# MappedProfileType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartSizeMap..::..MappedProfileType Property
FabricationPartSizeMap Class See Also
---
The mapped shape of the straight.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public ConnectorProfileType MappedProfileType { get; set; }
```

Visual Basic
---
```text
Public Property MappedProfileType As ConnectorProfileType
	Get
	Set
```

Visual C++
---
```text
public:
property ConnectorProfileType MappedProfileType {
	ConnectorProfileType get ();
	void set (ConnectorProfileType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace